{"template":"__react_static_root__/src/content/club/Page","sharedHashesByProp":{},"data":{"site":{"name":"Mason High School","directory":"mhs","coordinator":{"title":"Student Activities Assistant Director","name":"Lori Howard","email":"HowardL@masonohioschools.com"}},"page":{"timestamp":"2022-02-28T19:40:56.668Z","editorEmail":"paym@masonohioschools.com","name":"Science Olympiad ","category":"Academic","schoologyPage":"https://masonohioschools.schoology.com/group/5191176256","website":"http://www.masonscioly.org/","description":"Science Olympiad is a nation-wide competition that features 23 different science-related events. Our coach always compares it to a \"track team for SCIENCE.\" Teams of 15 students compete in groups of 2 or 3 in various STEM events. They can range from building and engineering to research and laboratory, covering topics surrounding physics, chemistry, biology, and technology.\n\nScience Olympiad is a program that promotes strong team bonds, leadership, and above all else, fosters a passion for STEM.","mobilityRating":"Medium","soundRating":"Medium","advisorName":"Megan Pay and Steven Seiler","advisorEmail":"paym@masonohioschools.com","additionalName":"Mason SciOly","additionalEmail":"masonscio@gmail.com","additionalTitle":"Team Captains","thumbURL":"https://drive.google.com/open?id=1ni94xMJA5T2DndW2UoWqmMK-zI8It3iq","additionalContent":"Yes","sectionOneTitle":"","sectionOneContent":"Science Olympiad is a nation-wide, team-based competition that features 23 different STEM events. Our coach always compares it to a “track team for SCIENCE”; each individual event contributes to our overall team score. Teams of 15 students represent Mason, and groups of 2 or 3 students compete in each event. The 23 events are build-based, laboratory-based, or study and research-based, and the STEM focus of each event surrounds biology, life sciences, chemistry, physics, earth and space sciences, engineering, and/or technology. Most competitors will choose to compete in 2 to 5 events that spark their interest in any given season.","sectionTwoTitle":"","sectionTwoContent":"Mason typically sends 2 or 3 teams to each competition, so up to 45 students represent our school every time. Since teams switch frequently throughout the season, students work with many different partners across the school year. Competition trips are usually overnight on Saturdays, at a high school or university either in-state or out-of-state, and Mason competes at ~10 competitions per season starting in December. Attending competitions eventually prepares us for the Regional, State, and National Tournament in May (which we won for the first time in 2021!).  Additionally, Mason Science Olympiad runs an Invitational of our own each spring where we host teams from different schools. This is an opportunity to better our understanding of each event, meet fellow Science Olympians across the nation, and give back to the Science Olympiad community.","sectionThreeTitle":"","sectionThreeContent":"Aside from the first couple months of the school year where we learn and brainstorm for each event together, this club has no recurring meetings; the time commitment is entirely self-decided. For each competitor, the season consists of both individual and collaborative preparation, exciting competition trips, and many, many memories. Ultimately, Science Olympiad is a program that promotes strong team bonds, leadership, and above all else, fosters a passion for STEM.","fileExtension":"png"}},"path":"mhs/science-olympiad-"}
