{"template":"__react_static_root__/src/content/club/Page","sharedHashesByProp":{},"data":{"site":{"name":"Mason High School","directory":"mhs","coordinator":{"name":"Lori Fox Allen","email":"AllenL@masonohioschools.com"}},"page":{"timestamp":"2022-02-25T19:03:43.495Z","editorEmail":"fragales@masonohioschools.com","name":"MHS Ski Club","category":"Sports","description":"We are a High School club that wants to share a passion for the sport of skiing and snowboarding. Our mission is to create a fun and safe skiing experience for our school community. We travel to Perfect North 4 times in the winter season, but also meet outside these ski trips for other school and community events. Spots are limited and are filled via a lottery.\n","mobilityRating":"High","soundRating":"High","advisorName":"Mr. Fragale","advisorEmail":"fragales@masonohioschools.com","additionalName":"Sasha Dunkirk","additionalEmail":"Sasha.Dunkirk98@masonohioschools.com ","additionalTitle":"Club Leader","thumbURL":"https://drive.google.com/open?id=1veEZLfSlLHc1t7xmtJWThOKz-dpxdmyl","additionalContent":"Yes","sectionOneTitle":"Additional Information:","sectionOneContent":"Registration for the club takes place in September/October. Our club numbers are limited to how many seats are available on the coach bus that we take to Perfect North Slopes (4 times each season).  When seats become available each year, there is a lottery for all students interested which closes on October 1st. The registration period will conclude once all seats are filled and the club will no longer be accepting new members at that point in time. \n \nFor students who don't \"hit the lottery\" all hope is not lost as they will then be placed on the waitlist, which is typically active each year as some current club members can no longer participate for various reasons. The order of the waitlist is determined by when they submitted their interest to the club lottery! Here is a link to next year’s lottery/waitlist: Ski Club Lottery 2022-2023.\n \nThere is a club fee of $165 which covers transportation, staff, end-of-the-year pizza party, and club shirt which is paid directly to MHS. Students will also need to purchase a pass that fits their needs through Perfect North Slopes. Directions on purchasing a pass through the club will be provided once the registration process is completed. Rental gear and lessons are also available through Perfect North Slopes depending on individual needs. ","sectionTwoTitle":"","sectionTwoContent":"","sectionThreeTitle":"","sectionThreeContent":"","fileExtension":"jpeg"}},"path":"mhs/mhs-ski-club"}
