{"template":"__react_static_root__/src/content/club/Page","sharedHashesByProp":{},"data":{"site":{"name":"Mason High School","directory":"mhs","coordinator":{"title":"Student Activities Director","name":"Lorri Allen","email":"AllenL@masonohioschools.com"}},"page":{"timestamp":"2022-03-22T22:56:40.616Z","editorEmail":"kbrackenridge@cinci.rr.com","name":"Mason High School Chess Team","category":"Sports","description":"The Mason High School Chess Team competes in the Greater Miami Conference against the other 9 GMC schools in 14 matches per season.  Although we can and do accept relative beginners onto the team, the primary purpose of the team is for those who already know how to play chess to improve and become better players.  Our team represents Mason HS in the conference and sometimes at State and National competitions. ","mobilityRating":"Low","soundRating":"Low","advisorName":"Dr. Keith Brackenridge","advisorEmail":"kbrackenridge@cinci.rr.com","additionalName":"","additionalEmail":"","additionalTitle":"","thumbURL":"https://drive.google.com/open?id=1TfTLB9RFfQ4XELQdAs8Wof1ZpMnF7cOT","additionalContent":"Yes","sectionOneTitle":"Season length","sectionOneContent":"Our season takes place mostly on Tuesday and Thursday afternoons from early October through early December.  We have some team practices; of those, certain ones might be deemed optional while others are mandatory.  Players who are in competition for a starting spot in the varsity lineup must attend “internal playoff” rounds that are scheduled.","sectionTwoTitle":"Competitions","sectionTwoContent":"The top 5 players compete in matches, with the strongest player competing on board #1, the second on board #2, etc.  We play a JV match consisting of however many extra players each school has available on a particular day.  There are 9 regular season matches, with around half of those being at home and half being away.  For away matches, we take a bus after school.","sectionThreeTitle":"Additional information","sectionThreeContent":"The season concludes with the top 7 players missing school for a full day to compete in the 2nd round of GMC competition, an all-day event held at another GMC school.  Players have an opportunity to earn 1st- or 2nd-team all-GMC and to help their team and school to earn points for the All-Sports Trophy in the conference.  Players on the team are typically serious enough about chess to be U. S. Chess Federation (USCF) members and to consider playing and competing for State or National Championships outside of the school season.  USCF membership is not required for the team but is strongly encouraged.","fileExtension":"png"}},"path":"mhs/mason-high-school-chess-team"}
