{"template":"__react_static_root__/src/content/club/Page","sharedHashesByProp":{},"data":{"site":{"name":"Mason High School","directory":"mhs","coordinator":{"title":"Student Activities Assistant Director","name":"Lori Howard","email":"HowardL@masonohioschools.com"}},"page":{"timestamp":"2023-08-29T16:19:11.598Z","editorEmail":"redcross.club@masonohioschools.com","name":"Red Cross Club","category":"Involvement","schoologyPage":"https://masonohioschools.schoology.com/group/2244056754","description":"The American Red Cross “prevents and alleviates human suffering in the face of emergencies by mobilizing the power of volunteers and the generosity of donors”. As the MHS Red Cross Club, we work together by supporting and encouraging this mission with service events throughout our community. ","mobilityRating":"Low","soundRating":"Medium","advisorName":"Paul Reedy","advisorEmail":"reedyp@masonohioschools.com","additionalName":"Emma Wei","additionalEmail":"emma.wei36@masonohioschools.com","additionalTitle":"Club Leader","thumbURL":"https://drive.google.com/open?id=1tBjjDQNI8eNC1eBeOJ6lLMspjpo5uOaB","additionalContent":"Yes","sectionOneTitle":"5 committees","sectionOneContent":"From the American Red Cross, there are 5 main lines of service that they work with specifically. We have decided to split our members up and have 5 committees, one for each line of service. The goal is for each committee to come up with a service project related to that line or service so we can have our members more involved in the process, and reach the requirement for a red cross club. Below is a description of each line of service. \nDisaster Services\nDisaster relief focuses not only on the most urgent disaster response efforts but prevention and preparedness as well. On any given day, when a disaster strikes, Disaster Action Teams and local caseworkers are deployed on-site, stationed at shelters, and on standby at local Red Cross chapters to help those affected receive the food, care, and basic resources they need to recover.\nService to the Armed Forces\nThis branch of the American Red Cross focuses on active service members, veterans, and their families. Emergency communications services play a central role—uniting families with the armed forces, connecting military hospitals and wounded warrior units, providing assistance in health care facilities, and more.\nTraining Services\nTraining and preparedness education are key facets to the Training Services branch. These training hope to enable those certified to prevent, prepare for, and respond in a number of life-threatening scenarios\nBlood Services (Biomedical Services)\nOne of the most well-known of the five lines of services, the American Red Cross Blood Services branch provides a life-saving supply of blood. \nInternational Services\nThe Red Cross strengthens leadership, financial management, volunteer networks, and supports the global movement. When disasters arise, American Red Cross volunteers are deployed to these locations in order to provide the most direct assistance to affected homes and families\n","sectionTwoTitle":"","sectionTwoContent":"","sectionThreeTitle":"","sectionThreeContent":"","fileExtension":"png"}},"path":"mhs/red-cross-club"}
