{"template":"__react_static_root__/src/content/club/Page","sharedHashesByProp":{},"data":{"site":{"name":"Mason High School","directory":"mhs","coordinator":{"title":"Student Activities Assistant Director","name":"Lori Howard","email":"HowardL@masonohioschools.com"}},"page":{"timestamp":"2022-03-23T15:22:44.976Z","editorEmail":"allenl@masonohioschools.com","name":"Black Student Union","category":"Involvement","schoologyPage":"https://masonohioschools.schoology.com/group/3220588644","description":"The Black Student Union is committed to highlighting and uplifting the varied realities of the African American experiences within our community.","mobilityRating":"Medium","soundRating":"Medium","advisorName":"LaQuita Miller","advisorEmail":"laquitamiller82@gmail.com","additionalName":"Javaris Powell","additionalEmail":"powelljav@masonohioschools.com","additionalTitle":"Advisor","thumbURL":"https://drive.google.com/open?id=1qzbs2rwXWoXvQkzlJxTtESocIagFsdVS","additionalContent":"Yes","sectionOneTitle":"About Us","sectionOneContent":"The MHS Black Student Union maintains that a multicultural and just community is the penultimate goal, however, we also recognize that the African American experience is a unique one, specifically in a predominantly white community. Therefore, we recognize the need to create a safe and affirming space, specifically geared to African American/Black students that speaks to their heritage, culture and history. By intentionally curating this community, we hope to form bonds between Black students that are, at times, hard to create given how we have been dispersed in the diaspora.  Consequently, the Black Student Union is critical to maintain, sustain, buttress and bolster African American students. We affirm our commitment to highlighting and uplifting the varied realities of the African American experiences within our community.  We recognize and affirm that everyone has a unique perspective and lens through which they engage the world.  We welcome all allies who are genuinely willing to support the organization by utilizing their time and talent for the uplifting of future leaders at MHS and beyond.","sectionTwoTitle":"","sectionTwoContent":"","sectionThreeTitle":"","sectionThreeContent":"","fileExtension":"png"}},"path":"mhs/black-student-union"}
