{"template":"__react_static_root__/src/content/club/Page","sharedHashesByProp":{},"data":{"site":{"name":"Mason High School","directory":"mhs","coordinator":{"title":"Student Activities Director","name":"Lorri Allen","email":"AllenL@masonohioschools.com"}},"page":{"timestamp":"2022-03-07T23:31:11.028Z","editorEmail":"mhswomeninstem@masonohioschools.com","name":"Women in STEM","category":"Academic","schoologyPage":"https://masonohioschools.schoology.com/group/4790703612","description":"MHS Women in STEM seeks to inspire young women to become leaders in the STEM community and to advocate for gender equality in STEM fields. We connect members with internships and summer programs, host guest speakers, and hold events that raise awareness of the gender inequalities within STEM fields. We also have opportunities for students to explore their unique interests and learn more about different fields of STEM.","mobilityRating":"Low","soundRating":"Medium","advisorName":"Diana Stroud","advisorEmail":"stroudd@masonohioschools.com","additionalName":"Women in STEM Leadership Team","additionalEmail":"mhswomeninstem@masonohioschools.com","additionalTitle":"Club Leader","thumbURL":"https://drive.google.com/open?id=106h-nRIbLUDMR0Li9hoALX9YN6BOq5Y5","additionalContent":"Yes","sectionOneTitle":"What does a typical meeting look like?","sectionOneContent":"We will feature a different STEM career each meeting. Hopefully, these small snippets of STEM careers will help you find possible careers! We will also try to feature different college/summer STEM programs so members can get insight into possible opportunities they want to pursue. This club will also be an advocate for gender equality in the STEM industry. We will work as a club to speak out for change. Some meetings we will have a guest speaker to help members learn more about a certain career! We are open to all new ideas! We look forward to hearing member's ideas for the club!\n","sectionTwoTitle":"How to stay connected!","sectionTwoContent":"Join our schoology group using access code QV6G-F2P9-P93CW to stay up to date on upcoming meetings and events. Follow our club on Instagram @masonwomeninstem to stay connected with what our club is doing! Reach out to mhswomeninstem@gmail.com or DM us on Instagram if you have any questions about joining our club! We take members all year, so just look on schoology to see when our next meeting is, and show up!!","sectionThreeTitle":"","sectionThreeContent":"","fileExtension":"png"}},"path":"mhs/women-in-stem"}
