[{"timestamp":"2022-02-25T18:25:44.414Z","editorEmail":"younga@masonohioschools.com","name":"Mason Drama Club","category":"Arts","schoologyPage":"https://masonohioschools.schoology.com/group/662480041","website":"www.masondrama.com","description":"Our club puts on the extra-curricular theater productions at Mason High School.  We do three shows a year, two plays in the fall and winter, and a musical in the spring.  We have over 200 students who participate each year, and positions for both actors and theater technicians.  ","mobilityRating":"Medium","soundRating":"Medium","advisorName":"Allen Young","advisorEmail":"younga@masonohioschools.com","additionalName":"","additionalEmail":"","additionalTitle":"","thumbURL":"https://drive.google.com/open?id=190nkkAoW-D4oPYtI9m1UczOGFO5LGf6N","additionalContent":"No","sectionOneTitle":"","sectionOneContent":"","sectionTwoTitle":"","sectionTwoContent":"","sectionThreeTitle":"","sectionThreeContent":"","fileExtension":"png"},{"timestamp":"2022-02-28T18:58:14.125Z","editorEmail":"stewartro@masonohioschools.com","name":"Spanish National Honor Society","category":"Academic","schoologyPage":"https://masonohioschools.schoology.com/group/592685141","website":"","description":"The purpose of this organization is to recognize high school scholastic achievement in the study of Spanish and to promote interest in the study of the Spanish language and Hispanic/Spanish culture.","mobilityRating":"Low","soundRating":"Medium","advisorName":"Rod Stewart","advisorEmail":"stewartro@masonohioschools.com","additionalName":"","additionalEmail":"","additionalTitle":"","thumbURL":"https://drive.google.com/open?id=1h8GvEIvHyGw1Ohc9NQOoFV_560eQiy92","additionalContent":"No","sectionOneTitle":"","sectionOneContent":"","sectionTwoTitle":"","sectionTwoContent":"","sectionThreeTitle":"","sectionThreeContent":"","fileExtension":"png"},{"timestamp":"2022-03-22T17:38:56.935Z","editorEmail":"allenl@masonohioschools.com","name":"Ice Hockey ","category":"Sports","schoologyPage":"","website":"www.cometicehockey.com","description":"We are an OHSAA sanctioned athletic team that competes with other high schools in the state. We offer options for both JV and Varsity teams and have a mix of experienced and beginner players. Whether you have been playing your whole life, or just want to get started, we would love to have you.\n","mobilityRating":"High","soundRating":"Medium","advisorName":"Joel Das","advisorEmail":"Info@cometicehockey.com","additionalName":"","additionalEmail":"","additionalTitle":"","thumbURL":"https://drive.google.com/open?id=1A4Cn5rp8ubs7j7G6tR1qD9hZ6P8hDOxJ","additionalContent":"Yes","sectionOneTitle":"","sectionOneContent":"","sectionTwoTitle":"","sectionTwoContent":"","sectionThreeTitle":"","sectionThreeContent":"","fileExtension":"png"},{"timestamp":"2022-03-08T02:19:01.202Z","editorEmail":"modelun.club@masonohioschools.com","name":"Model United Nations","category":"Academic","schoologyPage":"https://masonohioschools.schoology.com/group/648541929","website":"","description":"Model UN is a club where students travel to colleges and compete against other high school students to speak, debate, and collaborate on a plethora of world issues. Such issues can range from nuclear disarmament, climate change, health crises, and even space races. Much like the actual UN, students work together to draft comprehensive resolutions that work to solve the issue at hand. Students who participate in this program become more comfortable with public speaking and sharing their ideas in larger groups, skills that stay with them throughout their lives.","mobilityRating":"Medium","soundRating":"Medium","advisorName":"Nathan Coates","advisorEmail":"coatesn@masonohioschools.com","additionalName":"Model UN Leadership Team","additionalEmail":"modelun.club@masonohioschools.com","additionalTitle":"Club Leader","thumbURL":"https://drive.google.com/open?id=1jnmt9LYTfZJqkGgjh8I4J8ugSBCoISFx","additionalContent":"Yes","sectionOneTitle":"Conferences","sectionOneContent":"Club members participate in many ways, and attending conferences is one of them. Modeled off of the United Nations, students from schools across the nation work with one another on addressing pressing issues at conferences, representing nations and individuals with differing viewpoints. Conferences are hosted by colleges and high schools both virtually and in person, and the club has attended conferences at the following colleges in the past: Indiana University, Ohio State University, UC Berkeley, Yale, Georgetown University, and American University. These conferences typically take place over multiple days, with multiple sessions devoted to tackling different topics under the larger structure of a single United Nations Committee or similar organizational body. After hours of fruitful debate and discussion, delegates vote on a comprehensive solution tailored to the topic that everyone participating agrees on, promoting amity, cooperation, and understanding between students.","sectionTwoTitle":"WilmaMUN","sectionTwoContent":"Every year, Model UN hosts a conference of their own! The 2021-2022 school year marks the seventh iteration of Mason High School’s conference, with WilmaMUN II, following the renaming of the conference during the 2019-2020 school year (formerly known as WMHSMUN). Club members take time to create committees on their own to run them for delegates from local high schools. Topics and content vary widely, emphasizing creativity and originality with past committees including: The Eagle And Dragon: War In The South China Sea, Operation Nowhere and Entree: Murder Mystery, and 2100, Turn of the Century: The Race to Relocate and Reallocate in Global Climate Catastrophe. Every member will have the opportunity to present an idea to be voted upon and selected by the club, so we’re looking forward to seeing your submissions this fall! ","sectionThreeTitle":"Leadership","sectionThreeContent":"Model UN is the definition of a student run organization. The seven member leadership team is elected by the club every spring in a comprehensive process designed to eliminate all possible bias. But leadership also extends beyond elected positions, with each and every member expected to lead from within. Whether it be in committee, where you may lead your bloc of like minded delegates to advocate for your solution, or in preparation for WilmaMUN where you may lead a team of fellow club members to create a committee to follow your vision. Leadership is essential in Model UN, no matter who you are. ","fileExtension":"png"},{"timestamp":"2022-03-09T20:33:49.457Z","editorEmail":"brossa@masonohioschools.com","name":"Writers' Block ","category":"Arts","schoologyPage":"https://masonohioschools.schoology.com/group/662479725","website":"https://mhswritersblock.wixsite.com/writers-block","description":"Writers' Block is Mason High School's literary magazine.  It is published once each year in the spring and features writing and artwork from Mason students.  The goal of the club is to produce the magazine and highlight the artistic talents of our students.  ","mobilityRating":"Low","soundRating":"Medium","advisorName":"Mandi Bross ","advisorEmail":"brossa@masonohioschools.com ","additionalName":"N/A ","additionalEmail":"","additionalTitle":"Advisor","thumbURL":"https://drive.google.com/open?id=1awpx--D5nFQqZRZD986w9HxYBdFuaHGO","additionalContent":"No","sectionOneTitle":"","sectionOneContent":"","sectionTwoTitle":"","sectionTwoContent":"","sectionThreeTitle":"","sectionThreeContent":"","fileExtension":"webp"},{"timestamp":"2022-03-13T00:03:19.989Z","editorEmail":"schlaegerj@masonohioschools.com","name":"SIBS - Students Involving & Befriending Students","category":"Involvement","schoologyPage":"","website":"","description":"SIBS is a group of carefully selected upperclassmen who provide mentoring to the freshmen class, and awareness of social isolation and inclusion.  The SIBS meet their assigned freshmen during a Freshmen Orientation Day, and about 4-5 SIBS are assigned to each freshmen homeroom.  The SIBS also welcome and tour new students, perform community service, and engage in events that promote inclusivity and combat social isolation. ","mobilityRating":"Medium","soundRating":"High","advisorName":"Sarah Boselovic","advisorEmail":"Boselovics@masonohioschools.com","additionalName":"Angie Johnston","additionalEmail":"johnstona@masonohioschools.com","additionalTitle":"Assistant Advisor","thumbURL":"https://drive.google.com/open?id=1ka-t_sPYLJaZVmfgVUcR0_j4AWclYCks","additionalContent":"No","sectionOneTitle":"","sectionOneContent":"","sectionTwoTitle":"","sectionTwoContent":"","sectionThreeTitle":"","sectionThreeContent":"","fileExtension":"jpeg"}]