{"template":"__react_static_root__/src/content/club/Page","sharedHashesByProp":{},"data":{"site":{"name":"Mason High School","directory":"mhs","coordinator":{"name":"Lori Fox Allen","email":"AllenL@masonohioschools.com"}},"page":{"timestamp":"2022-03-22T17:55:45.900Z","editorEmail":"allenl@masonohioschools.com","name":"Mason Hack Club","category":"Technology","schoologyPage":"https://masonohioschools.schoology.com/group/648541173","website":"https://masonhackclub.com/","description":"Mason Hack Club is a computer programming club and is a chapter of the international Hack Club organization. We meet every Tuesday in room B109.\n\nOur weekly meetings include a wide array of computer science topics for our members to explore and learn. These topics include cybersecurity, web design, database management, Raspberry Pi computing, and many, many more! Members of Mason Hack Club not only get to learn about amazing CS topics, but they also get to compete against their peers, connect with companies, volunteer for the community, and showcase their awesome projects.\n\nMason Hack Club's main goal is to help students of all ages learn about computer programming through teaching workshops and building a community where students can share their passion for coding.\n\nOver the years, we've hosted and helped organize several events, such as our yearly coding camp for younger students named Mason Hack Camp, and hackathons like CincyHacks, CincyHacks Jr., and Hack Cincinnati. (Events are not set in stone due to the COVID-19 pandemic)\n\nMason Hack Club is sponsored by Cengage Learning.","mobilityRating":"Low","soundRating":"Medium","advisorName":"CJ Dicks","advisorEmail":"dicksc@masonohioschools.com","additionalName":"","additionalEmail":"","additionalTitle":"","thumbURL":"https://drive.google.com/open?id=1GeJ2fuUoaBdt3VSU5XktDxWJvuNOP4Ch","additionalContent":"No","sectionOneTitle":"","sectionOneContent":"","sectionTwoTitle":"","sectionTwoContent":"","sectionThreeTitle":"","sectionThreeContent":"","fileExtension":"png"}},"path":"mhs/mason-hack-club"}
